app/controllers/players_controller.rb

SELECT `players`.* FROM `players`
SELECT  `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1
---
  def index
    @players = Player.all
    player1 = Player.find 1